microwave/fluid-openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       3510;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       3540;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       3570;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       3630;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3600;
        startFace       3690;
    }
)

// ************************************************************************* //
